
## Plan Result

[CI link](https://github.com/kanade0404/private-infra/actions/runs/7074815992)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_storage_bucket.tfstate
  * google_storage_bucket_object.tfstate_directory[&#34;zaim&#34;]
  * random_uuid.uuid


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_storage_bucket.tfstate will be created
  + resource "google_storage_bucket" "tfstate" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.tfstate_directory["zaim"] will be created
  + resource "google_storage_bucket_object" "tfstate_directory" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "zaim"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/zaim"
      + storage_class  = (known after apply)
    }

  # random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":240,"Program":"tfcmt","SHA1":"707582f3423ec282cb5c2f507babd4cd71d7c81c","Vars":{},"WorkflowName":"Terraform"} -->